
## :x: Apply Failed

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3122274922)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/2a25f67d-7af9-4b6e-a778-e5d9b1696b4b/terraform-bin apply -auto-approve -input=false
data.http.ghactions_oidc_config: Reading...
data.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
data.tls_certificate.ghactions: Reading...
data.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
data.aws_iam_role.task_execution: Reading...
aws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.memo_board_tf_exec: Reading...
aws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]
data.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]
aws_iam_user.memo_board: Refreshing state... [id=memo-board]
data.aws_iam_policy_document.memo_board_tf1: Reading...
data.aws_caller_identity.current: Reading...
aws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]
data.aws_ecs_task_definition.memo_board_rs: Reading...
aws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]
data.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]
aws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]
data.aws_caller_identity.current: Read complete after 0s [id=281036478087]
data.aws_iam_policy_document.memo_board_tf: Reading...
data.aws_iam_policy_document.memo_board_cd: Reading...
data.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]
data.aws_iam_role.task_execution: Read complete after 0s [id=ecsTaskExecutionRole]
data.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]
aws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]
aws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]
data.aws_ecs_task_definition.memo_board_rs: Read complete after 0s [id=arn:aws:ecs:ap-northeast-1:281036478087:task-definition/memo_board_rs:1]
aws_ecr_lifecycle_policy.memo_board_rs: Refreshing state... [id=memo-board-rs]
data.aws_iam_policy_document.memo_board_cd1: Reading...
data.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2288384065]
aws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]
aws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]
aws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]
aws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]
aws_lb_target_group.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95]
aws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]
aws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]
aws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]
aws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]
aws_security_group.memo_board_lb: Refreshing state... [id=sg-00431c32160f37d85]
aws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]
aws_lb.memo_board: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]
aws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]
aws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]
aws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]
aws_lb_listener.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/26e500ed2f05c21e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_cluster.memo_board will be created
  + resource "aws_ecs_cluster" "memo_board" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "memo_board"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_cluster_capacity_providers.memo_board will be created
  + resource "aws_ecs_cluster_capacity_providers" "memo_board" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "memo_board"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE"
          + weight            = 0
        }
    }

  # aws_ecs_service.memo_board_rs will be created
  + resource "aws_ecs_service" "memo_board_rs" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "memo_board_rs"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "memo_board_rs:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "memo_board_rs"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-047a19359c4468354",
              + "subnet-0ae15c749b9813fb9",
              + "subnet-0f84ebfae4c920a30",
            ]
        }
    }

  # aws_iam_policy.memo_board_cd1 will be updated in-place
  ~ resource "aws_iam_policy" "memo_board_cd1" {
        id        = "arn:aws:iam::281036478087:policy/memo_board_cd1"
        name      = "memo_board_cd1"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "ecs:UpdateService",
                            "ecs:DescribeServices",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "AllowForECS"
                    },
                  ~ {
                      ~ Resource = "*" -> "arn:aws:iam::281036478087:role/ecsTaskExecutionRole"
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.memo_board_rs will be created
  + resource "aws_security_group" "memo_board_rs" {
      + arn                    = (known after apply)
      + description            = "For Fargate"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
        ]
      + name                   = "memo_board_rs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-07dac755b05cdc5e5"
    }

Plan: 4 to add, 1 to change, 0 to destroy.
aws_ecs_cluster.memo_board: Creating...
aws_iam_policy.memo_board_cd1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_security_group.memo_board_rs: Creating...
aws_iam_policy.memo_board_cd1: Modifications complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_security_group.memo_board_rs: Creation complete after 4s [id=sg-033af2ba0540ee42c]
aws_ecs_cluster.memo_board: Still creating... [10s elapsed]
aws_ecs_cluster.memo_board: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board]
aws_ecs_cluster_capacity_providers.memo_board: Creating...
aws_ecs_service.memo_board_rs: Creating...
aws_ecs_cluster_capacity_providers.memo_board: Still creating... [10s elapsed]
aws_ecs_cluster_capacity_providers.memo_board: Creation complete after 11s [id=memo_board]
╷
│ Error: error creating ECS service (memo_board_rs): InvalidParameterException: The container memo_board_rs did not have a container port 3000 defined.
│ 
│   with aws_ecs_service.memo_board_rs,
│   on ecs.tf line 19, in resource "aws_ecs_service" "memo_board_rs":
│   19: resource "aws_ecs_service" "memo_board_rs" {
│ 
╵
::debug::Terraform exited with code 1.
::debug::stdout: data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Adata.aws_iam_role.task_execution: Reading...%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_caller_identity.current: Reading...%0Aaws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]%0Adata.aws_ecs_task_definition.memo_board_rs: Reading...%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_caller_identity.current: Read complete after 0s [id=281036478087]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_role.task_execution: Read complete after 0s [id=ecsTaskExecutionRole]%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Adata.aws_ecs_task_definition.memo_board_rs: Read complete after 0s [id=arn:aws:ecs:ap-northeast-1:281036478087:task-definition/memo_board_rs:1]%0Aaws_ecr_lifecycle_policy.memo_board_rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2288384065]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0Aaws_lb_target_group.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95]%0Aaws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]%0Aaws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]%0Aaws_security_group.memo_board_lb: Refreshing state... [id=sg-00431c32160f37d85]%0Aaws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]%0Aaws_lb.memo_board: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]%0Aaws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]%0Aaws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]%0Aaws_lb_listener.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/26e500ed2f05c21e]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_cluster.memo_board will be created%0A  + resource "aws_ecs_cluster" "memo_board" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "memo_board"%0A      + tags_all           = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = (known after apply)%0A          + value = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_cluster_capacity_providers.memo_board will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "memo_board" {%0A      + capacity_providers = [%0A          + "FARGATE",%0A        ]%0A      + cluster_name       = "memo_board"%0A      + id                 = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE"%0A          + weight            = 0%0A        }%0A    }%0A%0A  # aws_ecs_service.memo_board_rs will be created%0A  + resource "aws_ecs_service" "memo_board_rs" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 100%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "memo_board_rs"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = "memo_board_rs:1"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "memo_board_rs"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = true%0A          + security_groups  = (known after apply)%0A          + subnets          = [%0A              + "subnet-047a19359c4468354",%0A              + "subnet-0ae15c749b9813fb9",%0A              + "subnet-0f84ebfae4c920a30",%0A            ]%0A        }%0A    }%0A%0A  # aws_iam_policy.memo_board_cd1 will be updated in-place%0A  ~ resource "aws_iam_policy" "memo_board_cd1" {%0A        id        = "arn:aws:iam::281036478087:policy/memo_board_cd1"%0A        name      = "memo_board_cd1"%0A      ~ policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                    # (2 unchanged elements hidden)%0A                    {%0A                        Action   = [%0A                            "ecs:UpdateService",%0A                            "ecs:DescribeServices",%0A                        ]%0A                        Effect   = "Allow"%0A                        Resource = "*"%0A                        Sid      = "AllowForECS"%0A                    },%0A                  ~ {%0A                      ~ Resource = "*" -> "arn:aws:iam::281036478087:role/ecsTaskExecutionRole"%0A                        # (3 unchanged elements hidden)%0A                    },%0A                ]%0A                # (1 unchanged element hidden)%0A            }%0A        )%0A        tags      = {}%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.memo_board_rs will be created%0A  + resource "aws_security_group" "memo_board_rs" {%0A      + arn                    = (known after apply)%0A      + description            = "For Fargate"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 8443%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 8443%0A            },%0A        ]%0A      + name                   = "memo_board_rs"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = (known after apply)%0A      + vpc_id                 = "vpc-07dac755b05cdc5e5"%0A    }%0A%0APlan: 4 to add, 1 to change, 0 to destroy.%0Aaws_ecs_cluster.memo_board: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_security_group.memo_board_rs: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifications complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_security_group.memo_board_rs: Creation complete after 4s [id=sg-033af2ba0540ee42c]%0Aaws_ecs_cluster.memo_board: Still creating... [10s elapsed]%0Aaws_ecs_cluster.memo_board: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board]%0Aaws_ecs_cluster_capacity_providers.memo_board: Creating...%0Aaws_ecs_service.memo_board_rs: Creating...%0Aaws_ecs_cluster_capacity_providers.memo_board: Still creating... [10s elapsed]%0Aaws_ecs_cluster_capacity_providers.memo_board: Creation complete after 11s [id=memo_board]%0A
::debug::stderr: ╷%0A│ Error: error creating ECS service (memo_board_rs): InvalidParameterException: The container memo_board_rs did not have a container port 3000 defined.%0A│ %0A│   with aws_ecs_service.memo_board_rs,%0A│   on ecs.tf line 19, in resource "aws_ecs_service" "memo_board_rs":%0A│   19: resource "aws_ecs_service" "memo_board_rs" {%0A│ %0A╵%0A
::debug::exitcode: 1

::set-output name=stdout::data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Adata.aws_iam_role.task_execution: Reading...%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_caller_identity.current: Reading...%0Aaws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]%0Adata.aws_ecs_task_definition.memo_board_rs: Reading...%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_caller_identity.current: Read complete after 0s [id=281036478087]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_role.task_execution: Read complete after 0s [id=ecsTaskExecutionRole]%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Adata.aws_ecs_task_definition.memo_board_rs: Read complete after 0s [id=arn:aws:ecs:ap-northeast-1:281036478087:task-definition/memo_board_rs:1]%0Aaws_ecr_lifecycle_policy.memo_board_rs: Refreshing state... [id=memo-board-rs]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2288384065]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0Aaws_lb_target_group.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95]%0Aaws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]%0Aaws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]%0Aaws_security_group.memo_board_lb: Refreshing state... [id=sg-00431c32160f37d85]%0Aaws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]%0Aaws_lb.memo_board: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]%0Aaws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]%0Aaws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]%0Aaws_lb_listener.memo_board_rs: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/26e500ed2f05c21e]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_ecs_cluster.memo_board will be created%0A  + resource "aws_ecs_cluster" "memo_board" {%0A      + arn                = (known after apply)%0A      + capacity_providers = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "memo_board"%0A      + tags_all           = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = (known after apply)%0A          + capacity_provider = (known after apply)%0A          + weight            = (known after apply)%0A        }%0A%0A      + setting {%0A          + name  = (known after apply)%0A          + value = (known after apply)%0A        }%0A    }%0A%0A  # aws_ecs_cluster_capacity_providers.memo_board will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "memo_board" {%0A      + capacity_providers = [%0A          + "FARGATE",%0A        ]%0A      + cluster_name       = "memo_board"%0A      + id                 = (known after apply)%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE"%0A          + weight            = 0%0A        }%0A    }%0A%0A  # aws_ecs_service.memo_board_rs will be created%0A  + resource "aws_ecs_service" "memo_board_rs" {%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 100%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "memo_board_rs"%0A      + platform_version                   = (known after apply)%0A      + scheduling_strategy                = "REPLICA"%0A      + tags_all                           = (known after apply)%0A      + task_definition                    = "memo_board_rs:1"%0A      + wait_for_steady_state              = false%0A%0A      + load_balancer {%0A          + container_name   = "memo_board_rs"%0A          + container_port   = 3000%0A          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95"%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = true%0A          + security_groups  = (known after apply)%0A          + subnets          = [%0A              + "subnet-047a19359c4468354",%0A              + "subnet-0ae15c749b9813fb9",%0A              + "subnet-0f84ebfae4c920a30",%0A            ]%0A        }%0A    }%0A%0A  # aws_iam_policy.memo_board_cd1 will be updated in-place%0A  ~ resource "aws_iam_policy" "memo_board_cd1" {%0A        id        = "arn:aws:iam::281036478087:policy/memo_board_cd1"%0A        name      = "memo_board_cd1"%0A      ~ policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                    # (2 unchanged elements hidden)%0A                    {%0A                        Action   = [%0A                            "ecs:UpdateService",%0A                            "ecs:DescribeServices",%0A                        ]%0A                        Effect   = "Allow"%0A                        Resource = "*"%0A                        Sid      = "AllowForECS"%0A                    },%0A                  ~ {%0A                      ~ Resource = "*" -> "arn:aws:iam::281036478087:role/ecsTaskExecutionRole"%0A                        # (3 unchanged elements hidden)%0A                    },%0A                ]%0A                # (1 unchanged element hidden)%0A            }%0A        )%0A        tags      = {}%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.memo_board_rs will be created%0A  + resource "aws_security_group" "memo_board_rs" {%0A      + arn                    = (known after apply)%0A      + description            = "For Fargate"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 8443%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 8443%0A            },%0A        ]%0A      + name                   = "memo_board_rs"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = (known after apply)%0A      + vpc_id                 = "vpc-07dac755b05cdc5e5"%0A    }%0A%0APlan: 4 to add, 1 to change, 0 to destroy.%0Aaws_ecs_cluster.memo_board: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifying... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_security_group.memo_board_rs: Creating...%0Aaws_iam_policy.memo_board_cd1: Modifications complete after 0s [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_security_group.memo_board_rs: Creation complete after 4s [id=sg-033af2ba0540ee42c]%0Aaws_ecs_cluster.memo_board: Still creating... [10s elapsed]%0Aaws_ecs_cluster.memo_board: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:281036478087:cluster/memo_board]%0Aaws_ecs_cluster_capacity_providers.memo_board: Creating...%0Aaws_ecs_service.memo_board_rs: Creating...%0Aaws_ecs_cluster_capacity_providers.memo_board: Still creating... [10s elapsed]%0Aaws_ecs_cluster_capacity_providers.memo_board: Creation complete after 11s [id=memo_board]%0A

::set-output name=stderr::╷%0A│ Error: error creating ECS service (memo_board_rs): InvalidParameterException: The container memo_board_rs did not have a container port 3000 defined.%0A│ %0A│   with aws_ecs_service.memo_board_rs,%0A│   on ecs.tf line 19, in resource "aws_ecs_service" "memo_board_rs":%0A│   19: resource "aws_ecs_service" "memo_board_rs" {%0A│ %0A╵%0A

::set-output name=exitcode::1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":22,"Program":"tfcmt","SHA1":"fe5220dc48f0a5d8604801ef9a7c5b1e1561414e","Vars":{},"WorkflowName":"Terraform"} -->